<big><b>Step 1:</b> Load the SQL extension</big>

In [1]:
%load_ext sql

<big><b>Step 2</b>: Connect sqlite to coursedata database</big>

In [2]:
%%sql

sqlite:///CourseDataWarehouseDemo.db

'Connected: @CourseDataWarehouseDemo.db'

<big><b>Step 3</b>: Use PRAGMA on the dimension tables to check that the structure of each table aligns with the ERD. We also ensure that each column used as a FK is "NOT NULL" for the fact tables there are no future errors related to the FK constraint.</big>

In [3]:
%%sql

PRAGMA table_info(INSTRUCTOR_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'IID', 'INTEGER', 0, None, 1), (1, 'Name', 'TEXT', 1, None, 0)]

In [4]:
%%sql

PRAGMA table_info(LOCATION_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'LID', 'INTEGER', 0, None, 1), (1, 'Location', 'TEXT', 1, None, 0)]

In [5]:
%%sql

PRAGMA table_info(PROGRAM_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'PID', 'INTEGER', 0, None, 1),
 (1, 'ProgramCode', 'TEXT', 1, None, 0),
 (2, 'ProgramName', 'TEXT', 1, None, 0)]

In [6]:
%%sql

PRAGMA table_info(CATALOG_COURSE_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'CAID', 'INTEGER', 0, None, 1),
 (1, 'CatalogID', 'TEXT', 1, None, 0),
 (2, 'Title', 'TEXT', 1, None, 0),
 (3, 'Attributes', 'TEXT', 0, None, 0),
 (4, 'Description', 'TEXT', 0, None, 0),
 (5, 'Prereqs', 'TEXT', 0, None, 0)]

In [23]:
%%sql

PRAGMA table_info(TIME_CODE_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'TCID', 'INTEGER', 0, None, 1), (1, 'Meetings', 'TEXT', 0, None, 0)]

In [8]:
%%sql

PRAGMA table_info(TERM_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'TermID', 'INTEGER', 0, None, 1), (1, 'Term', 'TEXT', 1, None, 0)]

In [11]:
%%sql

PRAGMA table_info(REG_COURSE_WH);

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(0, 'COID', 'INTEGER', 0, None, 1),
 (1, 'TCID', 'INTEGER', 0, None, 0),
 (2, 'LID', 'INTEGER', 0, None, 0),
 (3, 'CAID', 'INTEGER', 0, None, 0),
 (4, 'IID', 'INTEGER', 0, None, 0),
 (5, 'TermID', 'INTEGER', 0, None, 0),
 (6, 'PID', 'INTEGER', 0, None, 0),
 (7, 'Cap', 'INTEGER', 0, None, 0),
 (8, 'Act', 'INTEGER', 0, None, 0),
 (9, 'Rem', 'INTEGER', 0, None, 0),
 (10, 'Credits', 'INTEGER', 0, None, 0),
 (11, 'Day', 'TEXT', 0, None, 0),
 (12, 'Start', 'INTEGER', 0, None, 0),
 (13, 'End', 'INTEGER', 0, None, 0)]

<big><b>Step 4</b>: Random data tests to ensure that the data imported properly </big>

<b>4-1</b>: Testing the dimension tables to ensure the data loaded appropriately

In [12]:
%%sql

SELECT * 
FROM PROGRAM_WH
WHERE PID < 10;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, 'AN', 'Asian Studies'),
 (2, 'BU', 'Business'),
 (3, 'BL', 'Black Studies'),
 (4, 'BEN', 'Bioengineering'),
 (5, 'AR', 'Arabic'),
 (6, 'AY', 'Anthropology'),
 (7, 'AS', 'American Studies'),
 (8, 'JA', 'Japanese'),
 (9, 'AH', 'Art History')]

In [13]:
%%sql

SELECT * 
FROM LOCATION_WH
WHERE LID < 10;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, 'DSB 105'),
 (2, 'DSB 111'),
 (3, 'DSB 110A'),
 (4, 'DSB 108'),
 (5, 'DSB 110B'),
 (6, 'DSB 104'),
 (7, 'DSB 112'),
 (8, 'DSB 109'),
 (9, 'DSB 115')]

In [14]:
%%sql

SELECT * 
FROM INSTRUCTOR_WH
WHERE IID < 10;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos'),
 (6, 'Scott M  Brenner'),
 (7, 'Kevin C.  Cassidy'),
 (8, 'Bruce   Bradford'),
 (9, 'Milo W.  Peck')]

In [27]:
%%sql

SELECT * 
FROM CATALOG_COURSE_WH
WHERE CAID < 5;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, 'AN 0301', 'Independent Study', '', 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', ''),
 (2, 'AN 0310', 'Asian Studies Seminar', '', 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.', ''),
 (3, 'BU 0211', 'Legal Environment of Business', '', 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.', 'Junior standing.'),
 (4, 'BU 0220', 'Environmental Law and Policy', 'EVME Environmental Studies Major Elective, EVPE Environmental Studies Elective, EVSS Environmental Studies: Social Science, MGEL Management: General Elective', 'This course surveys issues arising out of federal laws designed to protect the environment and manage resources. It considers in detail the role of t ... (298 characters truncated) ... t groups in shaping environmental policy, giving special attention to the impact of environmental regulation on business and private property rights.', '')]

In [29]:
%%sql

SELECT * 
FROM TIME_CODE_WH
WHERE TCID < 5;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 (2, "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 (3, "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 (4, "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]")]

In [30]:
%%sql

SELECT * 
FROM TERM_WH
WHERE TermID < 5;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, 'Fall2014'), (2, 'Fall2015'), (3, 'Fall2016'), (4, 'Fall2017')]

<b>4-2</b>: Random test on the REG_COURSE_WH fact table to ensure the data imported properly

In [31]:
%%sql

SELECT  IID, PID, TCID, COUNT(*) AS Cnt
FROM REG_COURSE_WH
GROUP BY IID, PID, TCID
LIMIT 10;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(1, 12, 1, 1),
 (1, 12, 2, 1),
 (1, 12, 3, 1),
 (1, 12, 4, 1),
 (1, 12, 5, 1),
 (1, 12, 6, 1),
 (1, 12, 7, 1),
 (1, 12, 8, 1),
 (1, 12, 9, 1),
 (1, 12, 10, 1)]

<b>4-4</b>: Testing the MEETINGS_COURSE table and making sure the data aligns with the OFFERINGS_COURSE table and the CATALOG_COURSE table.

In [34]:
%%sql

SELECT Name, Meetings, ProgramName, COUNT(*)
FROM REG_COURSE_WH AS RC
    LEFT JOIN INSTRUCTOR_WH AS I
        ON (I.IID = RC.IID)
    LEFT JOIN PROGRAM_WH AS P
        ON (P.PID = RC.PID)
    LEFT JOIN TIME_CODE_WH AS TC
        ON (TC.TCID = RC.TCID)
GROUP BY Name, Meetings, ProgramName
LIMIT 10;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[('01/20-04/30', None, 'International Studies', 1),
 ('01/20-05/08', None, 'Communication', 15),
 ('05/21-08/17', None, 'Nursing', 1),
 ('08/15-01/15', None, 'Interior Design', 1),
 ('09/01-12/07', None, 'Music', 14),
 ('09/02-12/19', None, 'Quantitative Analysis', 1),
 ('09/02-12/30', None, 'Counseling', 1),
 ('09/02-12/30', None, 'Music', 2),
 ('09/02-12/30', None, 'Psychology', 1),
 ('Aaron K.  Perkus', None, 'English', 1)]